# Different Ways of Creating Dataframes

1. Using CSV
2. Using Excel
3. From python dictionary
4. From list of tuples
5. From list of dictionaries

In [1]:
import pandas as pd

## 1. Using CSV

In [2]:
df = pd.read_csv('weather.csv')
df

        day  temperature  windspeed  event
0  01/01/17           32          6   rain
1  01/02/17           35          7  sunny
2  01/03/17           28          2   snow
3  01/04/17           24          7   snow
4  01/05/17           32          4   rain
5  01/06/17           32          2  sunny

## 2. Using Excel

In [3]:
df1 = pd.read_excel('weather.xls')
df1

         day  temperature  windspeed  event
0 2017-01-01           32          6   rain
1 2017-02-01           35          7  sunny
2 2017-03-01           28          2   snow
3 2017-04-01           24          7   snow
4 2017-05-01           32          4   rain
5 2017-06-01           32          2  sunny

## 3. From Python Dictionary

In [4]:
customer_data = {
    'Id': ['1020161','1020162','1020163','1020164','1020165'],
    'Name': ['Kevin','Drake','Angela','Lisa','Liam'],
    'Country': ['USA','Columbia','India','England','Nigeria'],
    'Gender': ['M','M','F','F','M']
}

df2 = pd.DataFrame(customer_data)
print(df2)

        Id    Name   Country Gender
0  1020161   Kevin       USA      M
1  1020162   Drake  Columbia      M
2  1020163  Angela     India      F
3  1020164    Lisa   England      F
4  1020165    Liam   Nigeria      M

In [5]:
df2.set_index('Id', inplace=True)

In [6]:
df2

           Name   Country Gender
Id
1020161   Kevin       USA      M
1020162   Drake  Columbia      M
1020163  Angela     India      F
1020164    Lisa   England      F
1020165    Liam   Nigeria      M

In [8]:
df2.loc['1020163']

Name       Angela
Country     India
Gender          F
Name: 1020163, dtype: object

## 4. From List of Tuples

In [20]:
customer_val = [
    ('001','Prakhar','India','M'),
    ('002','Lisa','UK','F'),
    ('003','Nanda','India','F'),
    ('004','Matt','USA','M'),
    ('005','Zlatan','Sweden','M')
]

# mention the names of columns
# By default, columns will be given numbers 0,1,2,3,...
df3 = pd.DataFrame(customer_val, columns=["Id","Name","Country","Gender"])
df3

    Id     Name Country Gender
0  001  Prakhar   India      M
1  002     Lisa      UK      F
2  003    Nanda   India      F
3  004     Matt     USA      M
4  005   Zlatan  Sweden      M

## From List of Dictionaries

In [21]:
weather_data = [
    {'day':'1/1/2020', 'temperature': 10, 'windspeed': 10, 'event': 'Windy'},
    {'day':'1/2/2020', 'temperature': 15, 'windspeed': 6, 'event': 'Rain'},
    {'day':'1/3/2020', 'temperature': 34, 'windspeed': 4, 'event': 'Sunny'}
]

df4 = pd.DataFrame(weather_data)
df4

        day  temperature  windspeed  event
0  1/1/2020           10         10  Windy
1  1/2/2020           15          6   Rain
2  1/3/2020           34          4  Sunny